## CHAPTER 2) **DATA FRAME IN PANDAS**

In [54]:
import numpy as np
import pandas as pd

* **1) creating a data frame**

In [55]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary in Dollars': [65000, 70000, 62000, 85000]
}

In [56]:
df1 = pd.DataFrame(data)

In [57]:
df1

    Name  Age      City  Salary in Dollars
0   John   28  New York              65000
1   Anna   34     Paris              70000
2  Peter   29    Berlin              62000
3  Linda   42    London              85000

*(i) if creating a dataframe from a dictionary it without key*

In [58]:
data2 = [
	['ALI', 28, 'New York', 65000],
	['AMR', 34, 'Paris', 70000],
	['OMAR', 29, 'Berlin', 62000],
	['RASHID', 42, 'London', 85000]
]
df2 = pd.DataFrame(data2)

In [59]:
df2

        0   1         2      3
0     ALI  28  New York  65000
1     AMR  34     Paris  70000
2    OMAR  29    Berlin  62000
3  RASHID  42    London  85000

* it will give us 0,1,2,3 etc

*to add keys or from external we have to add extra lines of code;  coloumn for it*

In [60]:
data3 = [
	['ALI', 28, 'New York', 65000],
	['Amr', 54, 'Paris', 70000],
	['omar', 29, 'Berlin', 62000],
	['maaz', 37, 'London', 85000]
]
df3 = pd.DataFrame(data3)
df3.columns = ['Name', 'Age', 'City', 'Salary in the Dollars'] #this will add coloumn names to the dataframe , valiable.coloumns = [list of coloumn names]

In [61]:
df3

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

**2) Selection and Indexing of Columns**

In [62]:
df3

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

* To access the data form this data frame we will use:

In [63]:
df3['Name'] # to access a specific single coloumn

0     ALI
1     Amr
2    omar
3    maaz
Name: Name, dtype: object

In [64]:
df3[['Name', 'City']]  #to access multiple coloumns we have to use double square brackets [[]]

   Name      City
0   ALI  New York
1   Amr     Paris
2  omar    Berlin
3  maaz    London

**3) adding or creating a new column to data frame**

In [65]:
df3['Years of Experience'] = [5, 7, 6, 10] # to add a new coloumn to the dataframe
df3

   Name  Age      City  Salary in the Dollars  Years of Experience
0   ALI   28  New York                  65000                    5
1   Amr   54     Paris                  70000                    7
2  omar   29    Berlin                  62000                    6
3  maaz   37    London                  85000                   10

In [66]:
df3.drop('Years of Experience', axis=1)

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

In [67]:
df3.drop(0, axis = 0) # to drop a specific row , axis = 0 for row and axis = 1 for coloumn

   Name  Age    City  Salary in the Dollars  Years of Experience
1   Amr   54   Paris                  70000                    7
2  omar   29  Berlin                  62000                    6
3  maaz   37  London                  85000                   10

* but again if we wil run it then it will again show us with the remove  or dropvalue attached with it

* so to remove it completely we will use 'inplace' mtd.

In [68]:
df3.drop('Years of Experience',axis = 1 , inplace = True) # to remove the coloumn permanently we will use inplace = True
df3

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

In [69]:
df3

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

**4) Selecting Rows**

In [70]:
df3

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

* --) with the help of 'loc' and 'iloc' we can access the data frame elements.


* ***WE CAN ONLY ACCESS ROW WITH THE HELP OF 'loc'***

In [71]:
df3.loc[1] # to access a specific row by its index label using loc

Name                       Amr
Age                         54
City                     Paris
Salary in the Dollars    70000
Name: 1, dtype: object

In [72]:
df3.loc[0:2] # to access multiple rows by their index labels using loc

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000

In [73]:
df3.loc[[0,3]] # to access a specific element by its row and coloumn labels using loc

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
3  maaz   37    London                  85000

In [74]:
df3.iloc[0] # to access a specific row by its index position using iloc

Name                          ALI
Age                            28
City                     New York
Salary in the Dollars       65000
Name: 0, dtype: object

**5) Selecting Subsets of Rows and Columns**

In [75]:
df3

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

In [76]:
df3.loc[[0,1]][["City","Salary in the Dollars"]] # to access specific rows and specific coloumns

       City  Salary in the Dollars
0  New York                  65000
1     Paris                  70000

**6) Conditional Selection**

* In Conditional Selection, we apply conditions to select specific rows and columns from a DataFrame.

In [77]:
df3

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
1   Amr   54     Paris                  70000
2  omar   29    Berlin                  62000
3  maaz   37    London                  85000

***example 1 :                                                           
if i want to see the people of only who's age i less then 30***

In [78]:
df3[df3['Age'] < 30] # to filter rows based on a condition

   Name  Age      City  Salary in the Dollars
0   ALI   28  New York                  65000
2  omar   29    Berlin                  62000

***example 2 :                                                           
I only want poeple whose age is above 30 and their city must be berlin***

In [80]:
df3[(df3["Age"] > 25) & (df3["City"] == 'Berlin')] 

# to filter rows based on multiple conditions using & (and) and | (or) operators

   Name  Age    City  Salary in the Dollars
2  omar   29  Berlin                  62000